---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorTextType.ShowPredefined
enum: Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorTextType
source: html/40d48742-9b8f-98a6-1785-91123708e238.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleVectorTextType.ShowPredefined

Show vector text label only for points that have flag ValueAtPointFlags::DisplayText